# GetSiteLocation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectLocation..::..GetSiteLocation Method
ProjectLocation Class See Also
---
Gets the site location to which this project location refers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SiteLocation GetSiteLocation()
```

Visual Basic
---
```text
Public Function GetSiteLocation As SiteLocation
```

Visual C++
---
```text
public:
SiteLocation^ GetSiteLocation()
```

# Remarks
The site location object contains the longitude, latitude, and time-zone of the entire project site.
# See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace